### 进程的作用	
进程最重要的作用是提供了CR3，10-10-12分页下CR3指向页目录表，2-9-9-12分页下CR3指向页目录指针表。
每个进程有一个或多个线程。本质上，没有进程切换，只有线程切换。我们过去说进程切换是切换了CR3的值，实际上是切换线程时切换了CR3，只不过同一进程内的线程切换不会改变CR3。
进程是空间概念，进程为它的线程提供了CR3，那么它的线程访问同一个线性地址时，就能访问到同一个物理页。
attach 和 .process 本质就是切换CR3，attach的时候，就是改了CR3。
### 0环如何找到当前进程的 EPROCESS
不使用API的其中一种做法是通过 KPCR 找当前线程，然后+0x220找当前进程，示例代码如下：
3环驱动加载程序：
int _tmain(int argc, _TCHAR* argv[])
{
	printf("我是驱动加载程序，PID: %x\n", GetCurrentProcessId());
	LoadDriver(DRIVER_NAME, DRIVER_PATH);
	UnLoadDriver(DRIVER_NAME);
	getchar();
	return 0;
}
驱动程序：
NTSTATUS DriverEntry(PDRIVER_OBJECT driver, PUNICODE_STRING reg_path)
{
	PEPROCESS pEprocess = NULL;
	PCHAR ImageFileName;
	ULONG pid;
	__asm
	{
		mov eax, fs:[0x124];
		mov eax, [eax + 0x220];
		mov pEprocess, eax;
		mov eax, [eax + 0x84];
		mov pid, eax;
	}
	ImageFileName = (PCHAR)pEprocess + 0x174;
	DbgPrint("pid: %x, ImageFileName:%s\n",pid, ImageFileName);
	driver->DriverUnload = DriverUnload;
	return STATUS_SUCCESS;
}
上述程序说明，驱动加载后，执行驱动入口代码时，所属进程是系统进程。这和 DeviceIoControl 时情况又有所不同，DeviceIoControl 通信时，所属进程是发起通信的3环程序。

### KPROCESS 属性
KPROCESS 是 EPROCESS 的起始部分 0x6c 字节。
KPROCESS 结构
kd> dt _KPROCESS
ntdll!_KPROCESS
   +0x000 Header           : _DISPATCHER_HEADER
   +0x010 ProfileListHead  : _LIST_ENTRY
   +0x018 DirectoryTableBase : [2] Uint4B  //这个字段就是CR3
   +0x020 LdtDescriptor    : _KGDTENTRY
   +0x028 Int21Descriptor  : _KIDTENTRY
   +0x030 IopmOffset       : Uint2B
   +0x032 Iopl             : UChar
   +0x033 Unused           : UChar
   +0x034 ActiveProcessors : Uint4B
   +0x038 KernelTime       : Uint4B
   +0x03c UserTime         : Uint4B
   +0x040 ReadyListHead    : _LIST_ENTRY
   +0x048 SwapListEntry    : _SINGLE_LIST_ENTRY
   +0x04c VdmTrapcHandler  : Ptr32 Void
   +0x050 ThreadListHead   : _LIST_ENTRY
   +0x058 ProcessLock      : Uint4B
   +0x05c Affinity         : Uint4B
   +0x060 StackCount       : Uint2B
   +0x062 BasePriority     : Char
   +0x063 ThreadQuantum    : Char
   +0x064 AutoAlignment    : UChar
   +0x065 State            : UChar
   +0x066 ThreadSeed       : UChar
   +0x067 DisableBoost     : UChar
   +0x068 PowerState       : UChar
   +0x069 DisableQuantum   : UChar
   +0x06a IdealNode        : UChar
   +0x06b Flags            : _KEXECUTE_OPTIONS
   +0x06b ExecuteOptions   : UChar
KPROCESS主要成员介绍：
+0x000 Header : _DISPATCHER_HEADER
“可等待”对象，比如Mutex互斥体、Event事件等（WaitForSingleObject）

+0x018 DirectoryTableBase : [2] Uint4B
页目录表的基址（为啥是8字节？）

+0x020 LdtDescriptor : _KGDTENTRY
+0x028 Int21Descriptor : _KIDTENTRY
历史遗留，16位Windows 段选择子不够 每个进程都有一个LDT表
Int21Descriptor 是 DOS下要用的

+0x038 KernelTime : Uint4B
+0x03c UserTime : Uint4B
统计信息 记录了一个进程在内核模式/用户模式下所花的时间

+0x05c Affinity : Uint4B
规定进程里面的所有线程能在哪个CPU上跑,如果值为1，那这个进程的所以线程只能在0号CPU上跑(00000001)
如果值为3，那这个进程的所以线程能在0、1号CPU上跑(000000011)
如果值为4，那这个进程的所以线程能在2号CPU上跑(000000100)
如果值为5，那这个进程的所以线程能在0，2号CPU上跑(000000101)
4个字节共32位 所以最多32核 Windows64位 就64核
如果只有一个CPU 把这个设置为4 那么这个进程就死了

+0x062 BasePriority : Char
基础优先级或最低优先级 该进程中的所有线程最起码的优先级.

### EPROCESS 属性
EPROCESS 结构
kd> dt _EPROCESS
ntdll!_EPROCESS
   +0x000 Pcb              : _KPROCESS
   +0x06c ProcessLock      : _EX_PUSH_LOCK
   +0x070 CreateTime       : _LARGE_INTEGER
   +0x078 ExitTime         : _LARGE_INTEGER
   +0x080 RundownProtect   : _EX_RUNDOWN_REF
   +0x084 UniqueProcessId  : Ptr32 Void
   +0x088 ActiveProcessLinks : _LIST_ENTRY
   +0x090 QuotaUsage       : [3] Uint4B
   +0x09c QuotaPeak        : [3] Uint4B
   +0x0a8 CommitCharge     : Uint4B
   +0x0ac PeakVirtualSize  : Uint4B
   +0x0b0 VirtualSize      : Uint4B
   +0x0b4 SessionProcessLinks : _LIST_ENTRY
   +0x0bc DebugPort        : Ptr32 Void
   +0x0c0 ExceptionPort    : Ptr32 Void
   +0x0c4 ObjectTable      : Ptr32 _HANDLE_TABLE
   +0x0c8 Token            : _EX_FAST_REF
   +0x0cc WorkingSetLock   : _FAST_MUTEX
   +0x0ec WorkingSetPage   : Uint4B
   +0x0f0 AddressCreationLock : _FAST_MUTEX
   +0x110 HyperSpaceLock   : Uint4B
   +0x114 ForkInProgress   : Ptr32 _ETHREAD
   +0x118 HardwareTrigger  : Uint4B
   +0x11c VadRoot          : Ptr32 Void
   +0x120 VadHint          : Ptr32 Void
   +0x124 CloneRoot        : Ptr32 Void
   +0x128 NumberOfPrivatePages : Uint4B
   +0x12c NumberOfLockedPages : Uint4B
   +0x130 Win32Process     : Ptr32 Void
   +0x134 Job              : Ptr32 _EJOB
   +0x138 SectionObject    : Ptr32 Void
   +0x13c SectionBaseAddress : Ptr32 Void
   +0x140 QuotaBlock       : Ptr32 _EPROCESS_QUOTA_BLOCK
   +0x144 WorkingSetWatch  : Ptr32 _PAGEFAULT_HISTORY
   +0x148 Win32WindowStation : Ptr32 Void
   +0x14c InheritedFromUniqueProcessId : Ptr32 Void
   +0x150 LdtInformation   : Ptr32 Void
   +0x154 VadFreeHint      : Ptr32 Void
   +0x158 VdmObjects       : Ptr32 Void
   +0x15c DeviceMap        : Ptr32 Void
   +0x160 PhysicalVadList  : _LIST_ENTRY
   +0x168 PageDirectoryPte : _HARDWARE_PTE_X86
   +0x168 Filler           : Uint8B
   +0x170 Session          : Ptr32 Void
   +0x174 ImageFileName    : [16] UChar
   +0x184 JobLinks         : _LIST_ENTRY
   +0x18c LockedPagesList  : Ptr32 Void
   +0x190 ThreadListHead   : _LIST_ENTRY
   +0x198 SecurityPort     : Ptr32 Void
   +0x19c PaeTop           : Ptr32 Void
   +0x1a0 ActiveThreads    : Uint4B
   +0x1a4 GrantedAccess    : Uint4B
   +0x1a8 DefaultHardErrorProcessing : Uint4B
   +0x1ac LastThreadExitStatus : Int4B
   +0x1b0 Peb              : Ptr32 _PEB
   +0x1b4 PrefetchTrace    : _EX_FAST_REF
   +0x1b8 ReadOperationCount : _LARGE_INTEGER
   +0x1c0 WriteOperationCount : _LARGE_INTEGER
   +0x1c8 OtherOperationCount : _LARGE_INTEGER
   +0x1d0 ReadTransferCount : _LARGE_INTEGER
   +0x1d8 WriteTransferCount : _LARGE_INTEGER
   +0x1e0 OtherTransferCount : _LARGE_INTEGER
   +0x1e8 CommitChargeLimit : Uint4B
   +0x1ec CommitChargePeak : Uint4B
   +0x1f0 AweInfo          : Ptr32 Void
   +0x1f4 SeAuditProcessCreationInfo : _SE_AUDIT_PROCESS_CREATION_INFO
   +0x1f8 Vm               : _MMSUPPORT
   +0x238 LastFaultCount   : Uint4B
   +0x23c ModifiedPageCount : Uint4B
   +0x240 NumberOfVads     : Uint4B
   +0x244 JobStatus        : Uint4B
   +0x248 Flags            : Uint4B
   +0x248 CreateReported   : Pos 0, 1 Bit
   +0x248 NoDebugInherit   : Pos 1, 1 Bit
   +0x248 ProcessExiting   : Pos 2, 1 Bit
   +0x248 ProcessDelete    : Pos 3, 1 Bit
   +0x248 Wow64SplitPages  : Pos 4, 1 Bit
   +0x248 VmDeleted        : Pos 5, 1 Bit
   +0x248 OutswapEnabled   : Pos 6, 1 Bit
   +0x248 Outswapped       : Pos 7, 1 Bit
   +0x248 ForkFailed       : Pos 8, 1 Bit
   +0x248 HasPhysicalVad   : Pos 9, 1 Bit
   +0x248 AddressSpaceInitialized : Pos 10, 2 Bits
   +0x248 SetTimerResolution : Pos 12, 1 Bit
   +0x248 BreakOnTermination : Pos 13, 1 Bit
   +0x248 SessionCreationUnderway : Pos 14, 1 Bit
   +0x248 WriteWatch       : Pos 15, 1 Bit
   +0x248 ProcessInSession : Pos 16, 1 Bit
   +0x248 OverrideAddressSpace : Pos 17, 1 Bit
   +0x248 HasAddressSpace  : Pos 18, 1 Bit
   +0x248 LaunchPrefetched : Pos 19, 1 Bit
   +0x248 InjectInpageErrors : Pos 20, 1 Bit
   +0x248 VmTopDown        : Pos 21, 1 Bit
   +0x248 Unused3          : Pos 22, 1 Bit
   +0x248 Unused4          : Pos 23, 1 Bit
   +0x248 VdmAllowed       : Pos 24, 1 Bit
   +0x248 Unused           : Pos 25, 5 Bits
   +0x248 Unused1          : Pos 30, 1 Bit
   +0x248 Unused2          : Pos 31, 1 Bit
   +0x24c ExitStatus       : Int4B
   +0x250 NextPageColor    : Uint2B
   +0x252 SubSystemMinorVersion : UChar
   +0x253 SubSystemMajorVersion : UChar
   +0x252 SubSystemVersion : Uint2B
   +0x254 PriorityClass    : UChar
   +0x255 WorkingSetAcquiredUnsafe : UChar
   +0x258 Cookie           : Uint4B
+0x070 CreateTime : _LARGE_INTEGER
+0x078 ExitTime : _LARGE_INTEGER
进程的创建/退出时间

+0x084 UniqueProcessId : Ptr32 Void
进程的编号 任务管理器中的PID

+0x088 ActiveProcessLinks : _LIST_ENTRY
双向链表 所有的活动进程都连接在一起，构成了一个链表
PsActiveProcessHead指向全局链表头，该变量未导出。所有操作系统中正在运行的进程，可以通过这个字段隐藏某进程。

+0x090 QuotaUsage : [3] Uint4B +0x09c QuotaPeak : [3] Uint4B
物理页相关的统计信息

+0x0a8 CommitCharge : Uint4B
+0x0ac PeakVirtualSize : Uint4B
+0x0b0 VirtualSize : Uint4B
虚拟内存相关的统计信息

+0x11c VadRoot : Ptr32 Void
标识当前进程0-2G哪些地址被占用了

+0x0bc DebugPort : Ptr32 Void
+0x0c0 ExceptionPort : Ptr32 Void
调试相关

+0x0c4 ObjectTable : Ptr32 _HANDLE_TABLE
句柄表

+0x174 ImageFileName : [16] UChar
进程镜像文件名 最多16个字节

+0x1a0 ActiveThreads : Uint4B
活动线程的数量

+0x1b0 Peb : Ptr32 _PEB
PEB((Process Environment Block 进程环境块)：进程在3环的一个结构体，里面包含了进程的模块列表、是否处于调试状态等信息。

说明：每个进程一个EPROCESS结构体，EPROCESS结构体在内核空间中，调用OpenProcess时只是得到了这个EPROCESS得句柄，不是创建一个新的EPROCESS，只有创建新进程时候，才创建新的EPROCESS。

### 体会 DebugPort 的作用
用OD附加记事本，下断点，然后在windbg中清空EPROCESS中的DebugPort中的值，然后单步调试，观察结果(注意：OD不要使用插件 下载一个原版OD)。
我们可以通过修改EPROCESS中的DebugPort中的值，来反调试。

### ActiveProcessLinks 断链实现进程隐藏
使用windbg将某个进程断链（从EPROCESS中的ActiveProcessLinks摘除），然后在任务管理器中查找该进程。
之前在3环做过PEB断链的实验，和这次的要求没什么区别的。

我这里就实现这样的效果：隐藏所有记事本进程。加载驱动用KMD工具。代码如下：

#include <ntddk.h>

NTSTATUS DriverEntry(PDRIVER_OBJECT driver, PUNICODE_STRING reg_path);
VOID DriverUnload(PDRIVER_OBJECT driver);


NTSTATUS DriverEntry(PDRIVER_OBJECT driver, PUNICODE_STRING reg_path)
{
	PEPROCESS pEprocess, pCurProcess;
	PCHAR ImageFileName;
	// 获取 EPROCESS
	__asm
	{
		mov eax, fs:[0x124];
		mov eax, [eax + 0x220];
		mov pEprocess, eax;
	}
	pCurProcess = pEprocess;
	// 遍历 ActiveProcessLinks
	do 
	{
		ImageFileName = (PCHAR)pCurProcess + 0x174;
		if (strcmp(ImageFileName, "notepad.exe") == 0)
		{
			PLIST_ENTRY preNode, curNode, nextNode;
			// 初始化节点
			curNode = (PLIST_ENTRY)((ULONG)pCurProcess + 0x88);
			nextNode = curNode->Flink;
			preNode = curNode->Blink;
			// 上一个节点的下一个节点指向我的下一个节点
			preNode->Flink = curNode->Flink;
			// 下一个节点的上一个节点指向我的上一个节点
			nextNode->Blink = curNode->Blink;			
		}
		//DbgPrint("%s\n", ImageFileName);
		pCurProcess = (PEPROCESS)(*(PULONG)((ULONG)pCurProcess + 0x88) - 0x88);
	} while (pEprocess != pCurProcess);

	driver->DriverUnload = DriverUnload;
	return STATUS_SUCCESS;
}

VOID DriverUnload(PDRIVER_OBJECT driver)
{
	DbgPrint("驱动卸载成功\n");
}

驱动执行前，任务管理器中可以看到记事本进程，驱动执行后，ActiveProcessLinks 断链完成，notepad进程被隐藏了
但是这样断的不彻底，可以通过_ETHREAD找到这个进程。







