思考四个问题：
进0环后，原来的寄存器存在哪里？
如何根据系统调用号(eax中存储)找到要执行的内核函数？
调用时参数是存储到3环的堆栈，如何传递给内核函数？
2种调用方式是如何返回到3环的？
要分析 KiSystemService 和 KiFastCallEntry ，我们需要先了解几个结构体，_Trap_Frame，_ETHREAD，_KTHREAD，_KPCR，_NT_TIB 和 _KPRCB。

通过中断门进入内核后，调用的第一个函数是：KiSystemService 函数，该函数填充 _KTRAP_FRAME 

TSS表只有一张，但是系统里有成百上千的线程，线程进0环时，假设使用中断门，0环的ESP和SS从TSS表获取，怎么保证每个线程都有自己的堆栈，不互相冲突呢？答案是，线程切换时会修改TSS表，确保每个线程执行时，TSS里的ESP,SS都对应当前线程。
_Trap_Frame 和0环栈密切相关。用户定义中断进0环，涉及提权时，CPU会把5个寄存器的值压入0环堆栈，这是我们在中断门的课程里学习过的：
不提权push 3个：EFLAGS、CS3、EIP3
提权push 5个：SS3、ESP3、EFLAGS、CS3、EIP3
实际上，完整的0环的栈是长这样的，中断门进0环后，新的ESP指向偏移 0x068（Eip）处：
kd> dt _KTrap_Frame
nt!_KTRAP_FRAME
   +0x000 DbgEbp           : Uint4B //调试或其他通用寄存器、段寄存器等，这些寄存器3环和0环共同使用
   +0x004 DbgEip           : Uint4B
   +0x008 DbgArgMark       : Uint4B
   +0x00c DbgArgPointer    : Uint4B
   +0x010 TempSegCs        : Uint4B
   +0x014 TempEsp          : Uint4B
   +0x018 Dr0              : Uint4B
   +0x01c Dr1              : Uint4B
   +0x020 Dr2              : Uint4B
   +0x024 Dr3              : Uint4B
   +0x028 Dr6              : Uint4B
   +0x02c Dr7              : Uint4B
   +0x030 SegGs            : Uint4B
   +0x034 SegEs            : Uint4B
   +0x038 SegDs            : Uint4B
   +0x03c Edx              : Uint4B
   +0x040 Ecx              : Uint4B
   +0x044 Eax              : Uint4B
   +0x048 PreviousPreviousMode : Uint4B //从这里到ErrCode（包含ErrCode），这些都是windows中非易失寄存器，需要在中断例程中先保存
   +0x04c ExceptionList    : Ptr32 _EXCEPTION_REGISTRATION_RECORD
   +0x050 SegFs            : Uint4B
   +0x054 Edi              : Uint4B
   +0x058 Esi              : Uint4B
   +0x05c Ebx              : Uint4B
   +0x060 Ebp              : Uint4B
   +0x064 ErrCode          : Uint4B  //这个单独说明一下，有些时候，还需要压入一个ErrCode码，经常使用push 0 这样一条指令，先把这个位置占住
   +0x068 Eip              : Uint4B  //下面这三个就是中断门必须保存的三个寄存器（无论是否提权），iret返回地址到此处
   +0x06c SegCs            : Uint4B
   +0x070 EFlags           : Uint4B
   +0x074 HardwareEsp      : Uint4B  //下面这两个就是中断提权时，要保存3环的堆栈
   +0x078 HardwareSegSs    : Uint4B
   +0x07c V86Es            : Uint4B  //下面这四个是虚拟8086模式使用的寄存器，我们是保护模式，因此这几个寄存器不使用
   +0x080 V86Ds            : Uint4B
   +0x084 V86Fs            : Uint4B
   +0x088 V86Gs            : Uint4B

看反汇编代码的时候，有时候遇到db 66，这是前缀指令，在指示使用的是16位汇编指令，如果没有66，那么就是：mov eax,ecx 如果有66就是：mov ax,cx

fs进入0环后，会被改变
_KPCR, _NT_TIB, _KPRCB
这三个结构体存储了当前CPU的信息，其实这三个结构体是一个结构体，只不过抽象成三部分而已。地址固定是 0xffdff000（通过fs寄存器解析出来的）。

_KPCR
KPCR（Processor Control Region）是CPU控制区的意思，每个CPU都有一个KPCR结构。
kd> dt _NT_TIB
nt!_NT_TIB
   +0x000 ExceptionList    : Ptr32 _EXCEPTION_REGISTRATION_RECORD  //结构化异常链表，里面存储的异常处理函数
   +0x004 StackBase        : Ptr32 Void
   +0x008 StackLimit       : Ptr32 Void
   +0x00c SubSystemTib     : Ptr32 Void
   +0x010 FiberData        : Ptr32 Void
   +0x010 Version          : Uint4B
   +0x014 ArbitraryUserPointer : Ptr32 Void
   +0x018 Self             : Ptr32 _NT_TIB
_NT_TIB就是_KPCR的第一个成员

kd>  dt _KPCR
nt!_KPCR
   +0x000 NtTib            : _NT_TIB
   +0x01c SelfPcr          : Ptr32 _KPCR
   +0x020 Prcb             : Ptr32 _KPRCB
   +0x024 Irql             : UChar
   +0x028 IRR              : Uint4B
   +0x02c IrrActive        : Uint4B
   +0x030 IDR              : Uint4B
   +0x034 KdVersionBlock   : Ptr32 Void
   +0x038 IDT              : Ptr32 _KIDTENTRY
   +0x03c GDT              : Ptr32 _KGDTENTRY
   +0x040 TSS              : Ptr32 _KTSS
   +0x044 MajorVersion     : Uint2B
   +0x046 MinorVersion     : Uint2B
   +0x048 SetMember        : Uint4B
   +0x04c StallScaleFactor : Uint4B
   +0x050 DebugActive      : UChar
   +0x051 Number           : UChar
   +0x052 Spare0           : UChar
   +0x053 SecondLevelCacheAssociativity : UChar
   +0x054 VdmAlert         : Uint4B
   +0x058 KernelReserved   : [14] Uint4B
   +0x090 SecondLevelCacheSize : Uint4B
   +0x094 HalReserved      : [16] Uint4B
   +0x0d4 InterruptMode    : Uint4B
   +0x0d8 Spare1           : UChar
   +0x0dc KernelReserved2  : [17] Uint4B
   +0x120 PrcbData         : _KPRCB  //可以理解为一个拓展的结构体
_KPRCB是_KPCR最后一个成员
kd> dt _KPRCB
nt!_KPRCB
   +0x000 MinorVersion     : Uint2B
   +0x002 MajorVersion     : Uint2B
   +0x004 CurrentThread    : Ptr32 _KTHREAD
   +0x008 NextThread       : Ptr32 _KTHREAD
   +0x00c IdleThread       : Ptr32 _KTHREAD
   +0x010 Number           : Char
   +0x011 Reserved         : Char
   +0x012 BuildType        : Uint2B
   +0x014 SetMember        : Uint4B
   +0x018 CpuType          : Char
   +0x019 CpuID            : Char
   +0x01a CpuStep          : Uint2B
   +0x01c ProcessorState   : _KPROCESSOR_STATE
   +0x33c KernelReserved   : [16] Uint4B
   +0x37c HalReserved      : [16] Uint4B
   +0x3bc PrcbPad0         : [92] UChar
   +0x418 LockQueue        : [16] _KSPIN_LOCK_QUEUE
   +0x498 PrcbPad1         : [8] UChar
   +0x4a0 NpxThread        : Ptr32 _KTHREAD
   +0x4a4 InterruptCount   : Uint4B
   +0x4a8 KernelTime       : Uint4B
   +0x4ac UserTime         : Uint4B
   +0x4b0 DpcTime          : Uint4B
   +0x4b4 DebugDpcTime     : Uint4B
   +0x4b8 InterruptTime    : Uint4B
   +0x4bc AdjustDpcThreshold : Uint4B
   +0x4c0 PageColor        : Uint4B
   +0x4c4 SkipTick         : Uint4B
   +0x4c8 MultiThreadSetBusy : UChar
   +0x4c9 Spare2           : [3] UChar
   +0x4cc ParentNode       : Ptr32 _KNODE
   +0x4d0 MultiThreadProcessorSet : Uint4B
   +0x4d4 MultiThreadSetMaster : Ptr32 _KPRCB
   +0x4d8 ThreadStartCount : [2] Uint4B
   +0x4e0 CcFastReadNoWait : Uint4B
   +0x4e4 CcFastReadWait   : Uint4B
   +0x4e8 CcFastReadNotPossible : Uint4B
   +0x4ec CcCopyReadNoWait : Uint4B
   +0x4f0 CcCopyReadWait   : Uint4B
   +0x4f4 CcCopyReadNoWaitMiss : Uint4B
   +0x4f8 KeAlignmentFixupCount : Uint4B
   +0x4fc KeContextSwitches : Uint4B
   +0x500 KeDcacheFlushCount : Uint4B
   +0x504 KeExceptionDispatchCount : Uint4B
   +0x508 KeFirstLevelTbFills : Uint4B
   +0x50c KeFloatingEmulationCount : Uint4B
   +0x510 KeIcacheFlushCount : Uint4B
   +0x514 KeSecondLevelTbFills : Uint4B
   +0x518 KeSystemCalls    : Uint4B
   +0x51c SpareCounter0    : [1] Uint4B
   +0x520 PPLookasideList  : [16] _PP_LOOKASIDE_LIST
   +0x5a0 PPNPagedLookasideList : [32] _PP_LOOKASIDE_LIST
   +0x6a0 PPPagedLookasideList : [32] _PP_LOOKASIDE_LIST
   +0x7a0 PacketBarrier    : Uint4B
   +0x7a4 ReverseStall     : Uint4B
   +0x7a8 IpiFrame         : Ptr32 Void
   +0x7ac PrcbPad2         : [52] UChar
   +0x7e0 CurrentPacket    : [3] Ptr32 Void
   +0x7ec TargetSet        : Uint4B
   +0x7f0 WorkerRoutine    : Ptr32     void 
   +0x7f4 IpiFrozen        : Uint4B
   +0x7f8 PrcbPad3         : [40] UChar
   +0x820 RequestSummary   : Uint4B
   +0x824 SignalDone       : Ptr32 _KPRCB
   +0x828 PrcbPad4         : [56] UChar
   +0x860 DpcListHead      : _LIST_ENTRY
   +0x868 DpcStack         : Ptr32 Void
   +0x86c DpcCount         : Uint4B
   +0x870 DpcQueueDepth    : Uint4B
   +0x874 DpcRoutineActive : Uint4B
   +0x878 DpcInterruptRequested : Uint4B
   +0x87c DpcLastCount     : Uint4B
   +0x880 DpcRequestRate   : Uint4B
   +0x884 MaximumDpcQueueDepth : Uint4B
   +0x888 MinimumDpcRate   : Uint4B
   +0x88c QuantumEnd       : Uint4B
   +0x890 PrcbPad5         : [16] UChar
   +0x8a0 DpcLock          : Uint4B
   +0x8a4 PrcbPad6         : [28] UChar
   +0x8c0 CallDpc          : _KDPC
   +0x8e0 ChainedInterruptList : Ptr32 Void
   +0x8e4 LookasideIrpFloat : Int4B
   +0x8e8 SpareFields0     : [6] Uint4B
   +0x900 VendorString     : [13] UChar
   +0x90d InitialApicId    : UChar
   +0x90e LogicalProcessorsPerPhysicalProcessor : UChar
   +0x910 MHz              : Uint4B
   +0x914 FeatureBits      : Uint4B
   +0x918 UpdateSignature  : _LARGE_INTEGER
   +0x920 NpxSaveArea      : _FX_SAVE_AREA
   +0xb30 PowerState       : _PROCESSOR_POWER_STATE



查看CPU数量：
kd> dd KeNumberProcessors
8054d6e0  00000001 00000006 00009e0a a0013fff
8054d6f0  806bc7c0 00000000 00000000 0000005d
8054d700  8003f118 00000000 00000000 00000000
8054d710  00000001 00000000 00000001 00000000
8054d720  00000000 00000000 00000000 00000000
8054d730  00000000 00000000 00000000 00000000
8054d740  00000000 00000000 00000000 00000000
8054d750  00000000 00000000 00000000 00000000
看地址8054d6e0，值为1，只有1个CPU

查看KPCR：
kd> dd KiProcessorBlock L2
80554040  ffdff120 00000000
只有一个核，所以只有一个KPCR
ffdff120这个地址减去0x120就是KPCR的首地址
kd> dt _KPCR ffdff120-120
nt!_KPCR
   +0x000 NtTib            : _NT_TIB
   +0x01c SelfPcr          : 0xffdff000 _KPCR
   +0x020 Prcb             : 0xffdff120 _KPRCB
   +0x024 Irql             : 0 ''
   +0x028 IRR              : 0
   +0x02c IrrActive        : 0
   +0x030 IDR              : 0xffffffff
   +0x034 KdVersionBlock   : 0x80546cb8 Void
   +0x038 IDT              : 0x8003f400 _KIDTENTRY
   +0x03c GDT              : 0x8003f000 _KGDTENTRY
   +0x040 TSS              : 0x80042000 _KTSS
   +0x044 MajorVersion     : 1
   +0x046 MinorVersion     : 1
   +0x048 SetMember        : 1
   +0x04c StallScaleFactor : 0xa20
   +0x050 DebugActive      : 0 ''
   +0x051 Number           : 0 ''
   +0x052 Spare0           : 0 ''
   +0x053 SecondLevelCacheAssociativity : 0 ''
   +0x054 VdmAlert         : 0
   +0x058 KernelReserved   : [14] 0
   +0x090 SecondLevelCacheSize : 0
   +0x094 HalReserved      : [16] 0
   +0x0d4 InterruptMode    : 0
   +0x0d8 Spare1           : 0 ''
   +0x0dc KernelReserved2  : [17] 0
   +0x120 PrcbData         : _KPRCB

所以，对于FS寄存器，3环时候就是：PEB，0环时候就是KPCR

+0x120 PrcbData         : _KPRCB 这也是一个结构体，上面有具体的结构，他再偏移4字节就是： +0x004 CurrentThread    : Ptr32 _KTHREAD
kd> dt _KTHREAD
nt!_KTHREAD
   +0x000 Header           : _DISPATCHER_HEADER
   +0x010 MutantListHead   : _LIST_ENTRY
   +0x018 InitialStack     : Ptr32 Void
   +0x01c StackLimit       : Ptr32 Void
   +0x020 Teb              : Ptr32 Void
   +0x024 TlsArray         : Ptr32 Void
   +0x028 KernelStack      : Ptr32 Void
   +0x02c DebugActive      : UChar
   +0x02d State            : UChar
   +0x02e Alerted          : [2] UChar
   +0x030 Iopl             : UChar
   +0x031 NpxState         : UChar
   +0x032 Saturation       : Char
   +0x033 Priority         : Char
   +0x034 ApcState         : _KAPC_STATE
   +0x04c ContextSwitches  : Uint4B
   +0x050 IdleSwapBlock    : UChar
   +0x051 VdmSafe          : UChar
   +0x052 Spare0           : [2] UChar
   +0x054 WaitStatus       : Int4B
   +0x058 WaitIrql         : UChar
   +0x059 WaitMode         : Char
   +0x05a WaitNext         : UChar
   +0x05b WaitReason       : UChar
   +0x05c WaitBlockList    : Ptr32 _KWAIT_BLOCK
   +0x060 WaitListEntry    : _LIST_ENTRY
   +0x060 SwapListEntry    : _SINGLE_LIST_ENTRY
   +0x068 WaitTime         : Uint4B
   +0x06c BasePriority     : Char
   +0x06d DecrementCount   : UChar
   +0x06e PriorityDecrement : Char
   +0x06f Quantum          : Char
   +0x070 WaitBlock        : [4] _KWAIT_BLOCK
   +0x0d0 LegoData         : Ptr32 Void
   +0x0d4 KernelApcDisable : Uint4B
   +0x0d8 UserAffinity     : Uint4B
   +0x0dc SystemAffinityActive : UChar
   +0x0dd PowerState       : UChar
   +0x0de NpxIrql          : UChar
   +0x0df InitialNode      : UChar
   +0x0e0 ServiceTable     : Ptr32 Void
   +0x0e4 Queue            : Ptr32 _KQUEUE
   +0x0e8 ApcQueueLock     : Uint4B
   +0x0f0 Timer            : _KTIMER
   +0x118 QueueListEntry   : _LIST_ENTRY
   +0x120 SoftAffinity     : Uint4B
   +0x124 Affinity         : Uint4B
   +0x128 Preempted        : UChar
   +0x129 ProcessReadyQueue : UChar
   +0x12a KernelStackResident : UChar
   +0x12b NextProcessor    : UChar
   +0x12c CallbackStack    : Ptr32 Void
   +0x130 Win32Thread      : Ptr32 Void
   +0x134 TrapFrame        : Ptr32 _KTRAP_FRAME  //TrapFrame,也是一个线程一个
   +0x138 ApcStatePointer  : [2] Ptr32 _KAPC_STATE
   +0x140 PreviousMode     : Char    //先前模式，记录你是0环调我，还是3环调我
   +0x141 EnableStackSwap  : UChar
   +0x142 LargeStack       : UChar
   +0x143 ResourceIndex    : UChar
   +0x144 KernelTime       : Uint4B
   +0x148 UserTime         : Uint4B
   +0x14c SavedApcState    : _KAPC_STATE
   +0x164 Alertable        : UChar
   +0x165 ApcStateIndex    : UChar
   +0x166 ApcQueueable     : UChar
   +0x167 AutoAlignment    : UChar
   +0x168 StackBase        : Ptr32 Void
   +0x16c SuspendApc       : _KAPC
   +0x19c SuspendSemaphore : _KSEMAPHORE
   +0x1b0 ThreadListEntry  : _LIST_ENTRY
   +0x1b8 FreezeCount      : Char
   +0x1b9 SuspendCount     : Char
   +0x1ba IdealProcessor   : UChar
   +0x1bb DisableBoost     : UChar

每个线程都有一个_ETHREAD，_ETHREAD的第一个成员是_KTHREAD，所以，这里写的是_KTHREAD，可以直接转换成_ETHREAD
kd> dt _ETHREAD
nt!_ETHREAD
   +0x000 Tcb              : _KTHREAD
   +0x1c0 CreateTime       : _LARGE_INTEGER
   +0x1c0 NestedFaultCount : Pos 0, 2 Bits
   +0x1c0 ApcNeeded        : Pos 2, 1 Bit
   +0x1c8 ExitTime         : _LARGE_INTEGER
   +0x1c8 LpcReplyChain    : _LIST_ENTRY
   +0x1c8 KeyedWaitChain   : _LIST_ENTRY
   +0x1d0 ExitStatus       : Int4B
   +0x1d0 OfsChain         : Ptr32 Void
   +0x1d4 PostBlockList    : _LIST_ENTRY
   +0x1dc TerminationPort  : Ptr32 _TERMINATION_PORT
   +0x1dc ReaperLink       : Ptr32 _ETHREAD
   +0x1dc KeyedWaitValue   : Ptr32 Void
   +0x1e0 ActiveTimerListLock : Uint4B
   +0x1e4 ActiveTimerListHead : _LIST_ENTRY
   +0x1ec Cid              : _CLIENT_ID
   +0x1f4 LpcReplySemaphore : _KSEMAPHORE
   +0x1f4 KeyedWaitSemaphore : _KSEMAPHORE
   +0x208 LpcReplyMessage  : Ptr32 Void
   +0x208 LpcWaitingOnPort : Ptr32 Void
   +0x20c ImpersonationInfo : Ptr32 _PS_IMPERSONATION_INFORMATION
   +0x210 IrpList          : _LIST_ENTRY
   +0x218 TopLevelIrp      : Uint4B
   +0x21c DeviceToVerify   : Ptr32 _DEVICE_OBJECT
   +0x220 ThreadsProcess   : Ptr32 _EPROCESS
   +0x224 StartAddress     : Ptr32 Void
   +0x228 Win32StartAddress : Ptr32 Void
   +0x228 LpcReceivedMessageId : Uint4B
   +0x22c ThreadListEntry  : _LIST_ENTRY
   +0x234 RundownProtect   : _EX_RUNDOWN_REF
   +0x238 ThreadLock       : _EX_PUSH_LOCK
   +0x23c LpcReplyMessageId : Uint4B
   +0x240 ReadClusterSize  : Uint4B
   +0x244 GrantedAccess    : Uint4B
   +0x248 CrossThreadFlags : Uint4B
   +0x248 Terminated       : Pos 0, 1 Bit
   +0x248 DeadThread       : Pos 1, 1 Bit
   +0x248 HideFromDebugger : Pos 2, 1 Bit
   +0x248 ActiveImpersonationInfo : Pos 3, 1 Bit
   +0x248 SystemThread     : Pos 4, 1 Bit
   +0x248 HardErrorsAreDisabled : Pos 5, 1 Bit
   +0x248 BreakOnTermination : Pos 6, 1 Bit
   +0x248 SkipCreationMsg  : Pos 7, 1 Bit
   +0x248 SkipTerminationMsg : Pos 8, 1 Bit
   +0x24c SameThreadPassiveFlags : Uint4B
   +0x24c ActiveExWorker   : Pos 0, 1 Bit
   +0x24c ExWorkerCanWaitUser : Pos 1, 1 Bit
   +0x24c MemoryMaker      : Pos 2, 1 Bit
   +0x250 SameThreadApcFlags : Uint4B
   +0x250 LpcReceivedMsgIdValid : Pos 0, 1 Bit
   +0x250 LpcExitThreadCalled : Pos 1, 1 Bit
   +0x250 AddressSpaceOwner : Pos 2, 1 Bit
   +0x254 ForwardClusterOnly : UChar
   +0x255 DisablePageFaultClustering : UChar
   +0x258 KernelStackReference : Uint4B

逆向分析 KiSystemService
.text:00466481 ; =============== S U B R O U T I N E =======================================
.text:00466481
.text:00466481
.text:00466481 _KiSystemService proc near              ; CODE XREF: ZwAcceptConnectPort(x,x,x,x,x,x)+Cp
.text:00466481                                         ; ZwAccessCheck(x,x,x,x,x,x,x,x)+Cp ...
.text:00466481
.text:00466481 var_104         = dword ptr -104h
.text:00466481 var_100         = dword ptr -100h
.text:00466481 var_D0          = dword ptr -0D0h
.text:00466481 var_CC          = dword ptr -0CCh
.text:00466481 var_C8          = dword ptr -0C8h
.text:00466481 var_B0          = dword ptr -0B0h
.text:00466481 var_AC          = dword ptr -0ACh
.text:00466481 var_A8          = dword ptr -0A8h
.text:00466481 var_A3          = byte ptr -0A3h
.text:00466481 var_73          = byte ptr -73h
.text:00466481 arg_0           = dword ptr  4
.text:00466481 arg_64          = dword ptr  68h
.text:00466481 arg_69          = byte ptr  6Dh
.text:00466481
.text:00466481                 push    0               ; 错误码初始化为0
.text:00466483                 push    ebp             ; 保存3环寄存器的值
.text:00466484                 push    ebx
.text:00466485                 push    esi
.text:00466486                 push    edi
.text:00466487                 push    fs
.text:00466489                 mov     ebx, 30h
.text:0046648E                 mov     fs, bx          ; 设置 fs 选择子为 0x30
.text:0046648E                                         ; 查GDT表得到 ffc093df`f0000001
.text:0046648E                                         ; fs.base = ffdff000，指向当前CPU的KPCR结构
.text:00466491                 assume fs:nothing
.text:00466491                 push    dword ptr ds:0FFDFF000h ; 保存旧的 ExceptionList，然后把新的清成-1
.text:00466497                 mov     dword ptr ds:0FFDFF000h, 0FFFFFFFFh
.text:004664A1                 mov     esi, ds:0FFDFF124h ; esi 指向 CurrentThread
.text:004664A7                 push    dword ptr [esi+140h] ; 保存 CurrentThread.PreviousMode
.text:004664A7                                         ; PreviousMode = 0 表示从0环调用过来
.text:004664A7                                         ; PreviousMode != 0 表示从3环调用过来
.text:004664AD                 sub     esp, 48h        ; esp 指向 _KTRAP_FRAME
.text:004664B0                 mov     ebx, [esp+68h+arg_0]
.text:004664B4                 and     ebx, 1
.text:004664B7                 mov     [esi+140h], bl  ; 旧CS 与 1 的结果存入 PreviousMode
.text:004664BD                 mov     ebp, esp        ; ebp 指向 _KTRAP_FRAME
.text:004664BF                 mov     ebx, [esi+134h]
.text:004664C5                 mov     [ebp+3Ch], ebx  ; _KTRAP_FRAME.Edx 指向旧的 CurrentThread.TrapFrame
.text:004664C8                 mov     [esi+134h], ebp ; CurrentThread.TrapFrame 指向当前 _KTRAP_FRAME
.text:004664CE                 cld                     ; df = 0
.text:004664CF                 mov     ebx, [ebp+60h]  ; 3环ebp
.text:004664D2                 mov     edi, [ebp+68h]  ; 3环eip
.text:004664D5                 mov     [ebp+0Ch], edx  ; _KTRAP_FRAME.DbgArgPointer = edx
.text:004664D5                                         ; 这一步是保存3环API参数指针
.text:004664D8                 mov     dword ptr [ebp+8], 0BADB0D00h
.text:004664DF                 mov     [ebp+0], ebx    ; _KTRAP_FRAME.DbgEbp = _KTRAP_FRAME.Ebp
.text:004664E2                 mov     [ebp+4], edi    ; _KTRAP_FRAME.DbgEip = _KTRAP_FRAME.Eip
.text:004664E5                 test    byte ptr [esi+2Ch], 0FFh
.text:004664E9                 jnz     Dr_kss_a        ; 测试 CurrentThread.DebugActive
.text:004664E9                                         ; 如果正被调试，保存调试相关的寄存器到 _KTRAP_FRAME
.text:004664EF
.text:004664EF loc_4664EF:                             ; CODE XREF: Dr_kss_a+10j
.text:004664EF                                         ; Dr_kss_a+7Cj
.text:004664EF                 sti                     ; 允许中断
.text:004664F0                 jmp     loc_4665CD

KiSystemService完成了保存现场的工作。

KiFastCallEntry 做的事情是类似的，下面我贴出我逆向的结果。
.text:00466540 _KiFastCallEntry:                       ; DATA XREF: KiLoadFastSyscallMachineSpecificRegisters(x)+24o
.text:00466540                                         ; _KiTrap01+72o
.text:00466540                 mov     ecx, 23h
.text:00466545                 push    30h
.text:00466547                 pop     fs              ; fs = 0x30, ffc093df`f0000001, 0环数据段
.text:00466549                 mov     ds, ecx         ; ds = 0x23, 00cff300`0000ffff, 3环数据段
.text:0046654B                 mov     es, ecx         ; es = 0x23
.text:0046654D                 mov     ecx, ds:0FFDFF040h
.text:00466553                 mov     esp, [ecx+4]    ; esp = _KPCR.TSS.Esp0，切换到0环堆栈
.text:00466556                 push    23h             ; _KTRAP_FRAME.HardwareSegSs = 0x23
.text:00466558                 push    edx             ; _KTRAP_FRAME.HardwareEsp = edx, edx是3环栈顶.
.text:00466559                 pushf                   ; _KTRAP_FRAME.EFlags = EFlags
.text:0046655A
.text:0046655A loc_46655A:                             ; CODE XREF: _KiSystemService+96j
.text:0046655A                 push    2
.text:0046655C                 add     edx, 8          ; edx 指向3环API参数
.text:0046655F                 popf                    ; EFlags = 0x02，即清空0环所有标志位
.text:0046655F                                         ; 此时 esp 指向 EFlags
.text:00466560                 or      [esp+0A4h+var_A3], 2 ; _KTRAP_FRAME.EFlags 即3环 EFlags 的 IF = 1
.text:00466565                 push    1Bh             ; _KTRAP_FRAME.SegCs = 0x1B, 3环代码段
.text:00466567                 push    dword ptr ds:0FFDF0304h ; _KTRAP_FRAME.Eip = _KUSER_SHARED_DATA.SystemCallReturn
.text:0046656D                 push    0               ; _KTRAP_FRAME.ErrCode = 0
.text:0046656F                 push    ebp             ; _KTRAP_FRAME.Ebp = ebp
.text:00466570                 push    ebx             ; _KTRAP_FRAME.Ebx = ebx
.text:00466571                 push    esi             ; _KTRAP_FRAME.Esi = esi
.text:00466572                 push    edi             ; _KTRAP_FRAME.Edi = edi
.text:00466573                 mov     ebx, ds:0FFDFF01Ch ; ebx = _KPCR.SelfPcr，即 ebx 指向 _KPCR
.text:00466579                 push    3Bh             ; _KTRAP_FRAME.SegFs = 0x3B
.text:0046657B                 mov     esi, [ebx+124h] ; esi = _KPCR._KPRCB.CurrentThread
.text:00466581                 push    dword ptr [ebx] ; _KTRAP_FRAME.ExceptionList = _KPCR.NtTib.ExceptionList
.text:00466583                 mov     dword ptr [ebx], 0FFFFFFFFh ; _KPCR.NtTib.ExceptionList = -1
.text:00466589                 mov     ebp, [esi+18h]  ; ebp = _KPCR._KPRCB.CurrentThread.InitialStack
.text:0046658C                 push    1               ; _KTRAP_FRAME.PreviousPreviousMode = 1，表示从3环来
.text:0046658E                 sub     esp, 48h        ; esp 指向 _KTRAP_FRAME
.text:00466591                 sub     ebp, 29Ch
.text:00466597                 mov     byte ptr [esi+140h], 1 ; CurrentThread.PreviousMode = 1，表示从3环调用来
.text:0046659E                 cmp     ebp, esp
.text:004665A0                 jnz     short loc_46653C ; 如果 ebp != esp，跳转到异常处理
.text:004665A0                                         ; 正常情况下，esp，ebp 均指向 _KTRAP_FRAME
.text:004665A2                 and     dword ptr [ebp+2Ch], 0 ; _KTRAP_FRAME.Dr7 = 0
.text:004665A6                 test    byte ptr [esi+2Ch], 0FFh
.text:004665AA                 mov     [esi+134h], ebp ; CurrentThread.TrapFrame = ebp，即指向当前 _KTRAP_FRAME
.text:004665B0                 jnz     Dr_FastCallDrSave ; 如果DebugActive == 1（被调试），那么跳转到 Dr_FastCallDrSave
.text:004665B0                                         ; Dr_FastCallDrSave 的功能是保存调试寄存器
.text:004665B6
.text:004665B6 loc_4665B6:                             ; CODE XREF: Dr_FastCallDrSave+10j
.text:004665B6                                         ; Dr_FastCallDrSave+7Cj
.text:004665B6                 mov     ebx, [ebp+60h]
.text:004665B9                 mov     edi, [ebp+68h]
.text:004665BC                 mov     [ebp+0Ch], edx  ; _KTRAP_FRAME.DbgArgPointer = edx, 保存3环参数指针
.text:004665BF                 mov     dword ptr [ebp+8], 0BADB0D00h
.text:004665C6                 mov     [ebp+0], ebx    ; _KTRAP_FRAME.DbgEbp = _KTRAP_FRAME.Ebp
.text:004665C9                 mov     [ebp+4], edi    ; _KTRAP_FRAME.DbgEip = _KTRAP_FRAME.Eip
.text:004665CC                 sti

和 KiSystemService 大同小异，主要的区别是 sysenter 只改了eip,cs,ss，虽然esp也改了，但是windows不使用，而是从TSS里取esp0；另外sysenter并没有像中断门那样压栈，所以3环的 ss, esp, eflags, cs,eip都要在函数里依次保存到 _KTRAP_FRAME 。

